Revit 2027 API
NumberingFormatSettings.NumberOfParameters Property
 A property defining the number of parameters used in this formatting settings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfParameters { get; }
Public ReadOnly Property NumberOfParameters As Integer
	Get
public:
property int NumberOfParameters {
	int get ();
}
member NumberOfParameters : int with get
Property Value
Int32
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace